In [1]:
import pandas as pd

In [2]:
# Loading the data.
df = pd.read_csv('../Examensarbete_DS21/20k_tripadvisor_hotel_reviews.csv')
df.shape

(20491, 2)

In [3]:
# Let's have a look at our dataset.
df.head()

                                              Review  Rating
0  nice hotel expensive parking got good deal sta...       4
1  ok nothing special charge diamond member hilto...       2
2  nice rooms not 4* experience hotel monaco seat...       3
3  unique, great stay, wonderful time hotel monac...       5
4  great stay great stay, went seahawk game aweso...       5

In [4]:
# Checking for null values.
df.isna().any()

Review    False
Rating    False
dtype: bool

In [5]:
# Summary of dataset.
df.describe()

             Rating
count  20491.000000
mean       3.952223
std        1.233030
min        1.000000
25%        3.000000
50%        4.000000
75%        5.000000
max        5.000000

In [6]:
# Rating Distribution.
df['Rating'].value_counts()

Rating
5    9054
4    6039
3    2184
2    1793
1    1421
Name: count, dtype: int64

In [7]:
# If rating [1, 2, 3] = Negative and if rating [4, 5] = Positive
def ratings(rating):
    if rating>0 and rating<=3:
        return 0
    if rating>3 and rating<=5:
        return 1
    
df['Positive'] = df['Rating'].apply(ratings)
df.head()

                                              Review  Rating  Positive
0  nice hotel expensive parking got good deal sta...       4         1
1  ok nothing special charge diamond member hilto...       2         0
2  nice rooms not 4* experience hotel monaco seat...       3         0
3  unique, great stay, wonderful time hotel monac...       5         1
4  great stay great stay, went seahawk game aweso...       5         1

In [8]:
df['Character_Count'] = df['Review'].str.len()
df.head()

,Review,Rating,Positive,Character_Count
0,nice hotel expensive parking got good deal sta...,4,1,593
1,ok nothing special charge diamond member hilto...,2,0,1689
2,nice rooms not 4* experience hotel monaco seat...,3,0,1427
3,"unique, great stay, wonderful time hotel monac...",5,1,600
4,"great stay great stay, went seahawk game aweso...",5,1,1281

In [9]:
def word_count(review):
    review_list = review.split()
    return len(review_list)

df['Word_count'] = df['Review'].apply(word_count)
df.head()

,Review,Rating,Positive,Character_Count,Word_count
0,nice hotel expensive parking got good deal sta...,4,1,593,87
1,ok nothing special charge diamond member hilto...,2,0,1689,250
2,nice rooms not 4* experience hotel monaco seat...,3,0,1427,217
3,"unique, great stay, wonderful time hotel monac...",5,1,600,89
4,"great stay great stay, went seahawk game aweso...",5,1,1281,191

In [10]:
# Creates "id" column with unique ids.
df["id"] = df.index + 1

df.head()

,Review,Rating,Positive,Character_Count,Word_count,id
0,nice hotel expensive parking got good deal sta...,4,1,593,87,1
1,ok nothing special charge diamond member hilto...,2,0,1689,250,2
2,nice rooms not 4* experience hotel monaco seat...,3,0,1427,217,3
3,"unique, great stay, wonderful time hotel monac...",5,1,600,89,4
4,"great stay great stay, went seahawk game aweso...",5,1,1281,191,5

In [11]:
initial_processing_df = df

%store initial_processing_df

Stored 'initial_processing_df' (DataFrame)